<template>
  <div>
          <h3>Help me!!!!!!!!</h3>
          
          <h3>科艺控制台网站使用帮助</h3>
          浏览器兼容性<br />
          为了更好的提供体验，我们完全支持任何现代浏览器，而针对一些老旧的浏览器，可能会出现显示问题，以下是我们建议的浏览器和版本：<br />
          <P>
            <li>Safari 9+</li>
            <li>Firefox 38+</li>
            <li>Chrome 45+</li>
            <li>IE 10+</li>
            <li>Edge 12+</li>
            <li>Opera 30+</li>
            <br />
          </P>
          其他基于Webkit的第三方浏览器的最新版本，例如QQ浏览器、360浏览器等等,同样的，我们的网站采用响应式布局，支持在手机和Pad(iOS 9+,
          Android4.4+)上浏览。<br/> 
          <h3>如何使用</h3>
          <br />
          默认的我们采用IP和其他辅助手段进行粗略定位，如果需要定位到你的精准位置，可以点击网页上的定位按钮，我们会调用你设备上的精准定位信息，一般这时浏览器都会提醒你是否同意授予我们网站位置权限的提示窗口，点击同意，网站就会使用你的设备上的精准位置定位到你所在的城市天气。如果你的设备不支持位置信息或你拒绝了授予我们网站获取位置信息的权限，我们无法自动定位到你所在的详细地区。你也可以手动搜索你需要查看的城市。
          为什么显示明天会下雨但实际没有？<br />
          因为叫天气“预报”，预报属于预测科学，由于气候现象的复杂性，没有100%的办法做到完全模拟、预测和控制天气现象。目前我国晴雨准确率可达到85%及以上，等于或略优于世界最高水平，实际上的科艺控制台是非常值的信赖的。</br>
          <h3>为什么巴拉巴拉？</h3><br />
          我们都会有类似的经历，室外已经开始下雨，但是打开天气预报APP却显示阴天、多云甚至晴天，这是因为：
          实况天气是有一定延迟性的，换句话说就是实况天气并不是那么的实时。实况天气的生产过程大概三步：各气象站点上报-上报数据处理-对外发布，这些过程需要5-20分钟的时间来完成。因此往往在真正开始下雨的几分钟之后，我们才能在APP上看到天气已经变成了下雨。
          天气数据都是覆盖了一个区域，这个区域内有可能只有一小部分在降雨，而其他部分还是多云状态，巧合的是你正好在降雨的那一部分区域里。
          气象观测站是直接的、单独的，而气候现象是复杂的、广泛的，当我们使用一个点的数据去描述一个面的现象时，不可避免的又出现偏差，而这个偏差也正是我们不断努力去减少的动力。
          有问题要反馈<br />
          我们鼓励你反馈任何问题或者建议，正是这些反馈推动和风天气的不断进步。任何问题，请与我们联系。<br />
          更多帮助
        
  </div>
</template>
<script>
export default {
  data() {
    return {};
  },
  methods: {
    pic_click() {
      this.$router.push("/Index");
    },
  },
};
</script>

<style lang="less" scoped>
.el-header {
  background-color: #fff;
  color: #000;
  display: flex;
  justify-content: space-between;
  align-items: center;
  font-size: 20px;
  vertical-align: middle;
  > div {
    display: flex;
    align-items: center;
    span {
      margin-left: 10px;
    }
  }
}
.a,
br,
h1,
h2,
h3,
h4,
h5,
h6,
header,
hr,
li,
ol,
p,
span,
ul {
  margin: 0;
  padding: 0;
  line-height: 1.2;
}
</style>